using System;

//6. * Написать программу подсчета количества «Хороших» чисел в диапазоне от 1 до 1 000 000 000. 
//    Хорошим называется число, которое делится на сумму своих цифр.
//    Реализовать подсчет времени выполнения программы, используя структуру DateTime.
namespace Zhiganov
{
    partial class Program
    {
        static void Task6()
        {
            DateTime date1 =DateTime.Now;
            int d1 = 0;
            int d2 = 0;
            int d3 = 0;
            int d4 = 0;
            int d5 = 0;
            int d6 = 0;
            int d7 = 0;
            int d8 = 0;
            int d0 = 0;
            int countd = 0;
            for (int i = 1; i <= 1000000000; i++)
            {
                d0 = (i < 10) ? (i) : (i % 10);
                d1 = ((i < 100) && (i >= 10)) ? (i / 10) : (i % 100 / 10);
                d2 = ((i < 1000)&&(i>=100)) ? (i/100) : (i % 1000/100);
                d3 = ((i < 10000) && (i >= 1000)) ? (i / 1000) : (i % 10000 / 1000);
                d4 = ((i < 100000) && (i >= 10000)) ? (i/10000) : (i % 100000/10000);
                d5 = ((i < 1000000) && (i >= 100000)) ? (i / 100000) : (i % 1000000 / 100000);
                d6 = ((i < 10000000) && (i >= 1000000)) ? (i/1000000) : (i % 10000000/1000000);
                d7 = ((i < 100000000) && (i >= 10000000)) ? (i / 10000000) : (i % 100000000 / 10000000);
                d8 = ((i <= 1000000000) && (i >= 100000000)) ? (i/100000000) : (i % 1000000000/100000000);


                if ((i % (d0 + d1+d2+d3+d4+d5+d6+d7+d8)) == 0) countd++;
            }
            DateTime date2 = DateTime.Now;
            Console.WriteLine($"Good numbers count is {countd} ");
            Console.WriteLine($"Program execution time is {date1.Subtract(date2)}");

        }



    }
}



